## Production: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                |
|--------|--------------------------------------------------------------------|
| update | `aws_ssm_parameter.api_config`                                     |
|        | `module.api.aws_iam_policy.policies[0]`                            |
|        | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "api_policies" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:283582579564:parameter/github-secret-scanning-config",
            ]
        }
    }

  # aws_ssm_parameter.api_config will be updated in-place
  ~ resource "aws_ssm_parameter" "api_config" {
        id              = "github-secret-scanning-config"
      + insecure_value  = (known after apply)
        name            = "github-secret-scanning-config"
        tags            = {
            "CostCentre" = "github-secret-scanning-production"
            "Terraform"  = "true"
        }
      ~ version         = 4 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.api.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::283582579564:policy/github-secret-scanning-api-0"
        name      = "github-secret-scanning-api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:283582579564:parameter/github-secret-scanning-config"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "github-secret-scanning-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "github-secret-scanning-sentinel"
        tags                           = {
            "CostCentre" = "github-secret-scanning-production"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "CUSTOMER_ID" = (sensitive value)
              ~ "SHARED_KEY"  = (sensitive value)
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
